IDENTIFICATION DIVISION.
PROGRAM-ID. CPF_DIGIT_VERIFIER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CPF-NUMBER          PIC 9(09).
01 DV1                 PIC 9(01).
01 DV2                 PIC 9(01).
01 RESTO               PIC 9(02).
01 SOMA                PIC 9(02).
01 COUNT               PIC 9(02) VALUE 1.

PROCEDURE DIVISION.
    DISPLAY "Insira os nove primeiros dígitos do CPF: ".
    ACCEPT CPF-NUMBER.

    PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 9
        COMPUTE SOMA = SOMA + (FUNCTION MOD (CPF-NUMBER(COUNT:1) * COUNT, 11)).
    END-PERFORM.

    COMPUTE RESTO = FUNCTION MOD (SOMA, 11).
    IF RESTO < 2 THEN
        MOVE 0 TO DV1
    ELSE
        COMPUTE DV1 = 11 - RESTO
    END-IF.

    MOVE 0 TO SOMA.
    MOVE DV1 TO CPF-NUMBER(10:1).
    PERFORM VARYING COUNT FROM 1 BY 1 UNTIL COUNT > 10
        COMPUTE SOMA = SOMA + (FUNCTION MOD (CPF-NUMBER(COUNT:1) * COUNT, 11)).
    END-PERFORM.

    COMPUTE RESTO = FUNCTION MOD (SOMA, 11).
    IF RESTO < 2 THEN
        MOVE 0 TO DV2
    ELSE
        COMPUTE DV2 = 11 - RESTO
    END-IF.

    DISPLAY "O dígito verificador do CPF é: " DV1 DV2.

    STOP RUN.
